IdeaRS.OpenModel.Connection.PlateData
Provides data of the single plate

IdeaRS.OpenModel.Connection.PlateData.Id
Plate unique ID

IdeaRS.OpenModel.Connection.PlateData.Name
Name of the plate

IdeaRS.OpenModel.Connection.PlateData.Thickness
Thickness of the plate

IdeaRS.OpenModel.Connection.PlateData.Material
Name of the material

IdeaRS.OpenModel.Connection.PlateData.OutlinePoints
Outline points

IdeaRS.OpenModel.Connection.PlateData.Origin
Origin of the plate LCS

IdeaRS.OpenModel.Connection.PlateData.AxisX
LCS - Axis X

IdeaRS.OpenModel.Connection.PlateData.AxisY
LCS - Axis Y

IdeaRS.OpenModel.Connection.PlateData.AxisZ
LCS - Axis Z

IdeaRS.OpenModel.Connection.PlateData.Region
Geometry of the plate in svg format

IdeaRS.OpenModel.Connection.PlateData.OriginalModelId
Get or set the identification in the original model
In the case of the imported connection from another application